## Task

* Let's assume that we have a table with client's bank card balance to the end of the day. 
* A part of the table is unfilled. 
* Let's write a query to fill unknown values for every client with the last known value.

In [4]:
# table

# client_id | date | value
# --- | --- | ---
# 1 | 14.04.2021 | 10000
# 1 | 15.04.2021 | 5000
# 1 | 16.04.2021 | NaN
# 1 | 17.04.2021 | NaN
# 1 | 18.04.2021 | NaN
# 2 | 14.04.2021 | 250000
# 2 | 15.05.2021 | 250000
# 2 | 16.04.2021 | 230000
# 2 | 17.04.2021 | 230000
# 2 | 18.04.2021 | 225000
# 3 | 14.04.2021 | 50000
# 3 | 15.05.2021 | NaN
# 3 | 16.04.2021 | NaN
# 3 | 17.04.2021 | NaN
# 3 | 18.04.2021 | NaN

In [1]:
import pandas as pd
import pandasql as ps

In [24]:
table = '''1 | 14.04.2021 | 10000
1 | 15.04.2021 | 5000
1 | 16.04.2021 | NaN
1 | 17.04.2021 | NaN
1 | 18.04.2021 | NaN
2 | 14.04.2021 | 250000
2 | 15.05.2021 | 250000
2 | 16.04.2021 | 230000
2 | 17.04.2021 | 230000
2 | 18.04.2021 | 225000
3 | 14.04.2021 | 50000
3 | 15.05.2021 | NaN
3 | 16.04.2021 | NaN
3 | 17.04.2021 | NaN
3 | 18.04.2021 | NaN'''

In [25]:
[row.split(' | ') for row in table.split('\n')]

[['1', '14.04.2021', '10000'],
 ['1', '15.04.2021', '5000'],
 ['1', '16.04.2021', 'NaN'],
 ['1', '17.04.2021', 'NaN'],
 ['1', '18.04.2021', 'NaN'],
 ['2', '14.04.2021', '250000'],
 ['2', '15.05.2021', '250000'],
 ['2', '16.04.2021', '230000'],
 ['2', '17.04.2021', '230000'],
 ['2', '18.04.2021', '225000'],
 ['3', '14.04.2021', '50000'],
 ['3', '15.05.2021', 'NaN'],
 ['3', '16.04.2021', 'NaN'],
 ['3', '17.04.2021', 'NaN'],
 ['3', '18.04.2021', 'NaN']]

In [26]:
df = pd.DataFrame([row.split(' | ') for row in table.split('\n')])

In [27]:
df

    0           1       2
0   1  14.04.2021   10000
1   1  15.04.2021    5000
2   1  16.04.2021     NaN
3   1  17.04.2021     NaN
4   1  18.04.2021     NaN
5   2  14.04.2021  250000
6   2  15.05.2021  250000
7   2  16.04.2021  230000
8   2  17.04.2021  230000
9   2  18.04.2021  225000
10  3  14.04.2021   50000
11  3  15.05.2021     NaN
12  3  16.04.2021     NaN
13  3  17.04.2021     NaN
14  3  18.04.2021     NaN

In [33]:
column_names = 'client_id | date | value'.split(' | ')
column_names

['client_id', 'date', 'value']

In [31]:
df.columns = column_names

In [32]:
df

   client_id        date   value
0          1  14.04.2021   10000
1          1  15.04.2021    5000
2          1  16.04.2021     NaN
3          1  17.04.2021     NaN
4          1  18.04.2021     NaN
5          2  14.04.2021  250000
6          2  15.05.2021  250000
7          2  16.04.2021  230000
8          2  17.04.2021  230000
9          2  18.04.2021  225000
10         3  14.04.2021   50000
11         3  15.05.2021     NaN
12         3  16.04.2021     NaN
13         3  17.04.2021     NaN
14         3  18.04.2021     NaN

### Query

In [37]:
# 1 approach

ps.sqldf(
    """

    WITH grouped_table AS
(
SELECT client_id, date, value,
       COUNT(value) OVER(PARTITION BY client_id ORDER BY date) as grp
FROM df
)
SELECT client_id, date, 
       FIRST_VALUE() OVER(PARTITION BY grp ORDER BY date) AS new_val
FROM grouped_table
    
    """
    )

PandaSQLException: (sqlite3.OperationalError) wrong number of arguments to function FIRST_VALUE()
[SQL:

    WITH grouped_table AS
(
SELECT client_id, date, value,
       COUNT(value) OVER(PARTITION BY client_id ORDER BY date) as grp
FROM df
)
SELECT client_id, date,
       FIRST_VALUE() OVER(PARTITION BY grp ORDER BY date) AS new_val
FROM grouped_table

    ]
(Background on this error at: http://sqlalche.me/e/e3q8)